[
    {
        "position": "Buckeye Transplant Services - IT Project Manager",
        "timeframe": "2018-Present",
        "details": "Develops IT tools to aid all departments with process standardization and automation. Review processes from all divisions of company and create tools and programs to automate and streamline processes to improve overall work-flow. Develop and maintain company wide IT policies. Collaborate with outside development teams to improve current Buckeye EMR Charting System."
    },
    {
        "position": "Buckeye Transplant Services - Clinical Support Manager",
        "timeframe": "2016-2018",
        "details": "Demonstrated a comprehensive knowledge of UNOS Policy regarding organ evaluation, allocation, and surgical recovery and critical care management of the brain dead organ donor. Maintained the highest standards of professionalism, integrity and ethics modeling a standard of civility and excellence. Updated transplant center flow processes, DALS, contacts with any changes asap and ensured all coordinators on the contract and the Clinical Resource Manager were updated on all modifications in real time. Provided coordinator evaluations. Collaborated with Quality manager to ensure compliance, assess competency, address deficits and develop processes to proactively prevent errors. Effectively lead and supervised coordinators to achieve set targets. Provided positive leadership to motivate professional growth and development of coordinators."
    },
    {
        "position": "Buckeye Transplant Services - Import Transplant Coordinator/Lead Coordinator" ,
        "timeframe": "2013-2016",
        "details": "Demonstrated a comprehensive knowledge of UNOS Policy regarding organ evaluation, allocation, and surgical recovery and critical care management of the brain dead organ donor. Maintained the highest standards of professionalism, integrity and ethics modeling a standard of civility and excellence. Updated transplant center flow processes, DALS, contacts with any changes asap and ensured all coordinators on the contract. Helped train new coordinators to current processes."
    },
    {
        "position": "Indiana Donor Network - Procurement Transplant Coordinator",
        "timeframe": "2011-2013",
        "details": "Demonstrated a comprehensive knowledge of UNOS Policy regarding organ evaluation, allocation, and surgical recovery and critical care management of the brain dead organ donor. Maintained the highest standards of professionalism, integrity and ethics modeling a standard of civility and excellence.  Treated donor patient's at the bedside given standardized clinical guidelines.  Allocated organs to the national waitlist and facilitated any transportation needs for both local and incoming transplant centers. "
    }
]